cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/fonts'

brew 'awscli'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'dnsmasq'
brew 'docker-compose'
brew 'git'
brew 'grc'
brew 'heroku'
brew 'hub'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'nodenv'
brew 'node-build'
brew 'openssl'
brew 'parallel'
brew 'readline'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'ruby-build'
brew 'stern'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'airfoil'
cask 'atom'
cask 'backblaze'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tunnelblick'

cask 'font-noto-mono'
cask 'font-inconsolata'
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
