cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/fonts'

brew 'coreutils'
brew 'grc'
brew 'heroku'
brew 'hub'
brew 'node'
brew 'openssl'
brew 'postgresql', restart_service: :changed
brew 'readline'
brew 'redis', restart_service: :changed
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'vim'
brew 'zsh'

cask '1password'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spotify'

cask 'font-inconsolata'
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
